app/controllers/api/v1/events_controller.rb

SELECT "events".* FROM "events"
---
    def index
      @events = Event.all
      render json: { events: @events.map{ |event| EventSerializer.new(event) }}