app/controllers/api/v1/groups_controller.rb

INSERT INTO "groups" ("name", "user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "t"], ["user_id", 19], ["event_id", 1], ["created_at", "2019-08-08 10:50:59.232999"], ["updated_at", "2019-08-08 10:50:59.232999"]]
---
    def create
        group = Group.create( group_params )