app/controllers/api/v1/users_controller.rb

    def create
        user = User.create( user_params )
---
INSERT INTO "users" ("username", "first_name", "last_name", "bio", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

        def index
            @users = User.all
            render json: { users: @users.map{ |user| UserSerializer.new(user) }}, include: [:groups, :discussions]
---
SELECT "users".* FROM "users"
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 1]]