app/controllers/api/v1/venues_controller.rb

SELECT "venues".* FROM "venues"
---
         def index
             @venues = Venue.all